//При нажатии на кнопку должна вызываться функция setStorage
// и передавать в нее ключ(есть в константах) и ID фильма для записи в хранилище.
//
//Если ID фильма есть в хранилище, то подсвечивать кнопку и менять текст на удалить из...
// Если фильм есть в хранилище, то по нажатию на кнопку вызывать функцию deleteStorage
// и передавать в нее ключ(есть в константах) и ID фильма для удаления из хранилища
//
// Нужно сделать что бы фильм был либо в очереди, либо в просмотренных, и там и там не может быть.
// реализовать функцию которая будет вызываться при открытии модалки и проверять
// есть ли данный фильм в хранилище, и подсвечивать ее.
//
// Все тоже самое сделать и для кнопки watched, можно одну логику на 2 кнопки
